#  coding: utf-8

import sys
from ldap3 import Server, Connection, ALL, SUBTREE
import logging
from logging.handlers import RotatingFileHandler



# для изменения кодировки 1
import sys
  # определение кодировки
reload(sys)
sys.setdefaultencoding('utf8')
  # _______________________________


"""
  Описание скрипта
  -----------------


  Читает Users в AD , и выдает по ним все (или указанные) данные
        - если активировать раздел "# вывод всех данных полностью для каждого пользователя" - покажет полные данные по каждому User (с пометкой "entry = " )
        - если активировать раздел "# вывод всех указанных данных (если они есть) для каждого пользователя" - покажет только определенные в нем данные по каждому User
    
    
  Обрабатывает все записи в AD
  
    Но даже при этом ограничении, размера log файлов может не хватить.
      Тогда надо или увеличить максимальный размер log файле (переменная maxBytes - в байтах)
        или увеличить количество log файлов (переменная backupCount )


Работает с любого компа где установлен Python 2.7

_____________________________________________________________________________________________________________________________________________________"""






"""
  настойки систем
_____________________________________________________________________________________________________________________________________________________"""


  #------------------ логирование -----------------

   # Logging initializing
log_file = './AD_listUsersWithData_2_Pythin2.7.log'
logger = logging.getLogger("AD_listUsersWithData_Pythin2.7")
logger.setLevel(logging.DEBUG)
  # Set logging level @ params
maxBytes = 500000  # когда размер текущего лог-файла достигнет размера,  следующие записи будут попадать в другие файлы
backupCount = 1  # сколько всего будет сохраняться старых файлов логов (старые будут стираться) (+ рабочий файл)
handler = RotatingFileHandler(log_file, maxBytes=maxBytes, backupCount=backupCount, mode='a', encoding=None, delay=0)
formatter = logging.Formatter('%(asctime)s %(levelname)s %(funcName)s line %(lineno)d:   %(message)s')
handler.setFormatter(formatter)
logger.addHandler(handler)




 # ------------------ LDAP Settings -----------------
ldaphost = имя хоста LDAP (в кавычках)
ldaproot = 'dc=...,dc=LOCAL' вместо точек - требуемые параметры
ldapuser = 'cn=...,ou=...,ou=service users,dc=..,dc=local' вместо точек - требуемые параметры
ldappass = пароль доступа LDAP (в кавычках)
LDAPServer = Server(ldaphost, get_info=ALL)


      #------------------------------------------------
      # какие атрибуты показать
      #------------------------------------------------

attributes = ['*']   # просматривает все атрибуты каждой найденной записи в AD


"""
  КОНЕЦ 
    настойки систем
_____________________________________________________________________________________________________________________________________________________"""










"""
    сама прога
_____________________________________________________________________________________________________________________________________________________"""


print "\nThe program starts\n_____________________________________________________________________________________________________________________________________________________\n\n"
logger.info("\n\n\n\n\n\n\n\n\n------------------------------------ The program starts \n---------------------------------------")



try:

    # LDAP initializing - Получение из LDAP данных по пользователям
  LDAPConn = Connection(LDAPServer, ldapuser, ldappass, auto_bind=True)
  entry_generator = LDAPConn.extend.standard.paged_search(ldaproot, '(&(objectClass=person))', search_scope = SUBTREE,  get_operational_attributes=True, paged_size = 1000, generator=True, attributes=attributes)
  print("LDAPConn.search  OK ")
  logger.info("LDAPConn.search  OK ")

  total_entries = 0
  for entry in entry_generator:
    total_entries += 1
    print "\n--------------------------------------------"
    logger.info("--------------------------------------------")


    #   #########################################################
    #   # вывод всех данных полностью для каждого пользователя
    #   #########################################################
    #
    # print "entry = ", entry
    #
    #   #########################################################
    #   # КЛНЕЦ
    #   #       вывод всех данных полностью для каждого пользователя
    #   #########################################################




      ########################################################################
      # вывод всех указанных данных (если они есть) для каждого пользователя
      ########################################################################

    try:
      print entry['attributes']["telephoneNumber"]
      logger.info(entry['attributes']["telephoneNumber"])
    except Exception as e:
      None


      ########################################################################
      # КЛНЕЦ
      #       вывод всех указанных данных (если они есть) для каждого пользователя
      ########################################################################



  print('Total entries retrieved:', total_entries)



except Exception as e:
  print '\n\t!!!!!!!!!!!!!!!!!  find in LDAP - A type error occurred: ', str(e)
  print '\tError by find in LDAP: ' + str(sys.exc_info())
  sys.exit()




"""
  КОНЕЦ
    сама прога
_____________________________________________________________________________________________________________________________________________________"""



logger.info("\n------------------------------------ The program ends \n---------------------------------------\n\n\n\n\n")
print "\n---------------------------------------\n\tThe program ends\n---------------------------------------"